{
	"About": "Über mich",
	"Projects": "Projekte",
	"Contact": "Kontakt",

	"MobileWarning": "Hey! Deint Bildschirm scheint im Portrait Modus zu sein oder zu klein zu sein... Bist du am Handy? Diese Website sieht am PC viel besser aus, also schau doch mal auf einem größeren Bildschirm vorbei~",

	"BackToTop": "Zurück nach Oben",

	"LandingPageHeader": "{year}Y/o Informatik Student aus DE",
	"LandingPageWelcome": "Hey! Willkommen auf meiner kleinen Portfolio Website!\n\nWenn du geschäftlich hier bist, würde ich dir empfehlen direkt bei\n 'Über Mich' zu den Skills und auf meine 'Projekte' Seite zu gehen\nInfos über meine Person und einen Kontakt wirst du ja sicher schon haben~\n\nWenn du einfach nur zum Spaß hier bist... Joa, viel Spaß~!\nEine professionellere Sprache ist über den Pro/Cas Toggle verfügbar.",

	"FooterCopyright": "Ⓒ Skifty {year}",

	"AboutMeHeader": "Über Mich",
	"AboutMeIntro": "Hey! Ich bin Skifty, grade {year} Jahre alt und mache derzeit meinen Informatik Bachelor hier in Deutschland!",
	"AboutMeTechHeader": "Wie ich in Tech reingerutscht bin",
	"AboutMeTechContent": "Mit Computern bin ich schon sehr früh in Kontakt gekommen (glaub irgendwann Anfang der Grundschule) und hatte mich direkt in Videospiele verliebt.\n\nAls ich so ca. 12 war bin ich dann ins Programmieren gerutscht, hauptsächlich eigentlich weil ich coole Minecraft Mods gesehen hatte und selber welche machen wollte.\nIn der Mod Entwicklung bin ich aber nie wirklich geblieben, stattdessen hab ich viel lieber Plugins für Minecraft Server geschrieben. So hab ich mir übrigens auch selber Java beigebracht!\n\nÜber die Jahre hab ich mir viel Erfahrung, auch in anderen Programmiersprachen, angeeignet, mein komplettes Skillset kannst du sehen, wenn du einfach mal runter scrollst~",
	"AboutMeRightNowHeader": "Was ich grade mache",
	"AboutMeRightNowContent": "Ich arbeite seit Oktober 2021 als Werkstudent und beschäftige mich mit FullStack- und Cloud-Entwicklung, außerdem bin ich, wie bereits erwähnt, an meinem Informatik Bachelor dran!\nIch arbeite auch nebenbei an ein paar Projekten, ihr könnt alle meine Sachen auf meinem Github finden!\n\nNach meinem Bachelor-Abschluss werde ich wahrscheinlich direkt in den Job Markt springen und dann mal sehen, wohin mich das Leben führt~",
	"AboutMeWorkMindsetHeader": "Wie es ist mit mir zu arbeiten",
	"AboutMeWorkMindsetContent": "Ich bin nicht wirklich einer der gerne am 'Socializen' ist, kleine Gruppen sind mir viel lieber als Große. Ich hab zwar schon gerne Leute um mich rum, aber auf zu viele Menschen kommt mein Hirn einfach garnich klar lol.\nIch würd mich trotzdem als zuverlässigen Teamspieler bezeichnen~!\n\nCode-Qualität ist mir sehr wichtig. Ich verbringe lieber ein paar Stunden mehr mit einem Projekt, damit es sauber und verständlich ist, anstatt es einfach 'as-is' zu deployen. Dazu gehört auch, saubere Kommentare und externe Dokumentation (wenn nötig) zu erstellen, damit andere (und auch ich selber nach ein paar Monaten) verstehen warum etwas so ist, wie es ist.",
	"AboutMeHobbiesHeader": "Was ich in meiner Freizeit mache",
	"AboutMeHobbiesContent": "Neben Software-Entwicklung, sind Videospiele eins meiner großen Hobbies, so bin ich in den ganzen Tech-Krams reingerutscht und so werd ich wahrscheinlich auch sterben lol\nWen's intressiert, ich war sowohl in Brawlhalla als auch in Rocket League ein halbwegs High-Ranked Spieler (Rocket League hab ich ebenfalls Uniliga gespielt) und hab auch viel Coaching Erfahrung in beiden Spielen!\n\nMMOs sind ebenfalls 'n großer Teil von meinem Leben, hatte damals mit WoW angefangen und bin langsam jetzt zu FF14 gewechselt, während ich nebenbei auch andere MMOs wie Lost Ark oder New World gespielt hatte!\n\nWenn's dir nicht eh schon vom Profilbild aufgefallen ist, ich bin n riesen Anime Nerd, wenn jemand meine AniList findet und 'se mir über eine der Kontaktmöglichkeiten zukommen lässt, für denjenigen hab ich vielleicht sogar 'ne Kleinigkeit... Nur wenn du mir deinen Lieblingsanime nennst und warum~\n\nWas gibt's sonst noch... Ah, Ich benutz Arch btw, ebenfalls riesen Linux Nerd, is sowohl mein tägliches OS und ich hab auch n Steam Deck für Linux unterwegs!",

	"GuiAPI Description": "Das ist eine Minecraft API geschrieben in Java und Paper/Spigot.\n\nSie erlaubt es Entwicklern ihre eigenen GUIs zu bauen mit denen die Spieler interagieren können!\n\nEs hat ein paar vorkonfigurierte Fenster, z.B. ein Simples Einseitiges Fenster, ein Fenster das mehrere Seiten erlaubt, ein Fenster für Texteingabe UND ein vollwertiges Handelsfenster, das es Spielern erlaubt Items zu tauschen!\n\nDiese Fenster können ebenfalls vom Entwickler erweitert werden und alles ist schön dokumentiert, was es Entwicklern sehr einfach erlaubt ihre eigenen Fenster zu erstellen.",

	"Warframe Item Description": "Ein Bot für die Chatting Platform Discord, geschrieben in Typescript/JavaScript und DiscordJS\n\nDieser Bot ist dafür erstellt worden, dir zu helfen deinen Fortschritt im Spiel 'Warframe' im Blick zu halten (da das Spiel weit über 900 Levelbare Waffen hat)\n\nDer Bot läuft in einem deiner Discord Server, erstellt sich spezielle Chaträume für jede Item Kategorie und bietet Befehle an mit denen du Waffen von deiner Todo-Liste streichen kannst.\n\nEr kann dir ebenfalls Information zu Items geben, wo du sie kriegst, was du alles brauchst, etc. Sollte er eine Information nicht direkt haben, kann er dir auch einen Link zum Wiki schicken!.",

	"Website Project": "Diese Website Lol",
	"Website Description": "Die komplette Website hier ist mit Sass, React und Typescript geschrieben!\n\nAlle Komponenten sind 100% selber von mir geschrieben, nur der Schwebende Pfeil (wie der bei der Skills Seite) und das Link Icon sind von 'Material UI Icons' und die Fonts 'Lato' (für Texte wie diesen hier) und 'Exo 2' (für Überschriften) sind von Google Fonts.\n\nEigentlich wollte ich die Website zuerst komplett nur in HTML/CSS/JS schreiben, hab dann aber nach der ersten Seite gemerkt, dass React nicht zu benutzen, wenn ich die Möglichkeit dazu hab, eigentlich nur 'ne riesen Zeitverschwendung ist lol",

	"Hitori Bot Description": "Das ist mein persönlicher Discord-Bot, geschrieben komplett in Typescript mit DiscordJS und einem Webinterface mit React und Tailwind!\nIch füge immer wieder mal Commands hinzu, wenn ich sie brauche, also ist es ein bisschen chaotisch, aber es ist mein Chaos~\n\nGrade kann der Bot Discord Server archivieren und die Daten in einer lokalen SQLite Datei speichern (mit Medien, etc) und dazu passend gibt's ein Webinterface, um alle Archive anzusehen und zu durchsuchen, das macht deinen Discord Server ein bisschen zukunftssicherer~ (Ihr müsst trotzdem nich offline gehen, Discord, danke)\n\nAn sich wird der Bot immer erweitert, aber ich bin mir noch nicht sicher, was als nächstes kommen soll, also wenn du irgendwelche Ideen hast, kannst du mir gerne schreiben~",

	"Frostlight Widgets Description": "Das hier sind Desktop Widgets, erstellt in AGS, womit man JS benutzen kann um GTK3 Widgets zu erstellen!\n\nIch hab die für meinen eigenen Desktop erstellt, und sie sind auch heute noch im Einsatz!\nMehr Screenshots kannst du auf der GitHub Repo finden!\nDie Widgets sind noch nicht komplett fertig, es ist einiges geplant, die Roadmap ist ebenfalls auf der GitHub Repo!\nMedia Controls, Theme Customization, ein Application Launcher, ein Notification Center, you name it!",

	"More Projects": "Mehr kommt noch!",
	"More Projects Text": "Grade sind das alle Projekte, die ich auf dieser Website teilen will, ich hab zwar andere öffentliche Projekte, aber die sind entweder nicht so tadellos wie ich sie gern hätte, oder halt einfach noch garnicht fertig...\n\nWenn du dir diese Projekte trotzdem mal anschauen willst, kannst du einfach auf 'Mehr kommt noch' (oder auf das Bild) klicken um auf mein GitHub zu kommen, das geht übrigens für alle Projekte hier~"
}
