{
	"About": "About",
	"Projects": "Projects",
	"Contact": "Contact",

	"MobileWarning": "Hey! Your Monitor seems to be in Portrait mode or too small... are you on mobile? This Website looks best on Desktop, I'd recommend you switch over to a bigger Screen~",

	"BackToTop": "Back to Top",

	"LandingPageHeader": "{year}Y/o CS Student from Germany",
	"LandingPageWelcome": "Hey! Welcome to my small little Portfolio Website\n\nIf you're here on business, I'd recommend you head straight for my Skills\n in the 'About' Section or my 'Projects' Page\nSince you'll probably already have my personal and contact information~\n\nIf you're here just for fun... Welcome, have fun!",

	"FooterCopyright": "Ⓒ Skifty {year}",

	"AboutMeHeader": "About Me",
	"AboutMeIntro": "Hey! I'm Skifty, I'm currently {year} years old and working on my CS Bachelor's Degree here in Germany!",
	"AboutMeTechHeader": "How I got into Tech",
	"AboutMeTechContent": "I've gotten into contact with Computers pretty early on (I must've been like 6 when my Dad let me use his old PC) and fell in love with Video Games at that time.\n\nAt around the Age of 12 I started getting into Development, mostly just because I saw cool Minecraft Mods and wanted to make my own.\nI never really got that much into Mod Development tho, and instead ended up writing Plugins for Minecraft Servers, this was the way I taught myself Java!\n\nOver the years, I've accumulated a lot more Experience, in other programming languages as well, you can see my whole Skillset on the next page~",
	"AboutMeRightNowHeader": "What I'm doing right now",
	"AboutMeRightNowContent": "Since October 2021 I'm working as a working Student, doing FullStack and Cloud Development, as well as working on my CS Bachelor's Degree!\nI'm also working on a few Projects on the side, you can find all of my stuff on my Github!\n\nAfter my Bachelor's Degree I'll probably jump straight into the job market and then I'll see where life takes me~",
	"AboutMeWorkMindsetHeader": "What I'm like at Work",
	"AboutMeWorkMindsetContent": "I'm not really much of a socializing guy, I love working in small teams, rather than in bigger ones. I like having some company around me, but too many people kinda creep me out lol.\nThat being said tho, I consider myself a really reliable Team player~!\n\nCode Quality is really important to me, I'd rather spend a few more hours on a Project to make it look clean and understandable, than just rushing it out the door.\nI'm also a big fan of Documentation, I like to write down what I'm doing, so that others can understand my thought process and I can understand it myself in a few months time",
	"AboutMeHobbiesHeader": "What I do in my free time",
	"AboutMeHobbiesContent": "Besides Programming, I really enjoy playing games, that's the way I got into Tech and that's probably the way I'm gonna die as well lol\nIf anyone's interested, I've been a high ranked Brawlhalla and Rocket League Player (I even played a bit of Collegiate Rocket League there!) and have experience coaching both games!\n\nMMOs are also a big part of my life, I started with WoW and transitioned over to FF14 while playing other MMOs like Lost Ark and New World on the side!\n\nIf you can't already tell from my Profile Picture I'm a huge Anime Nerd, if someone finds my AniList Page and sends it to my email, I'll maybe give you a present, only if you tell me your favorite Anime tho~\n\nWhat else is there... Oh yeah, I use Arch btw, hugeass Linux Nerd, both daily driving it and got a Steam deck for the Linux Experience on the go!",

	"Wordle Solver Description": "A Program that solves the Game 'Wordle' via Information Theory. The Solver itself is written in JavaScript. The Repo also includes Wordle reimplemented inside Html so that I could realiably test the solver.\n\nTo play, the solver takes screenshots of your desktop and evaluates them to find out where the playfield is. It then calculates the most optimal guess based on word entropy, plays it, and checks the feedback of the game via pixel-colors from another screenshot.\n\nIf you want a more in-depth explanation, check the Repo Description!",

	"GuiAPI Description": "This is a Minecraft API I wrote using Java and Paper/Spigot.\n\nIt allows Developers to easily build their own GUIs that players can interact with!\n\nIt comes with a few PreConfigured Windows, such as a Simple One-Pager, a GUI allowing Multiple Pages, a Window designed for Text Input AND a Full Trade Window, allowing Item to Item Player Trading!\n\nBesides all of that tho, every Window is expandable and everything is neatly documented, allowing developers to create their own windows with ease.",

	"Warframe Item Description": "This is a Discord Bot I wrote using TypeScript/JavaScript with DiscordJS\n\nThe Bot is designed to help you keep track of your Progression in the Game 'Warframe' (as it has well over 900 weapons you can level up lol)\n\nThe Bot is designed to run on Discord, making special channels for each item category on a server and providing commands to check off Items on your list.\n\nIt also displays infos about your missing Items, where to get them, what you need to craft them, etc., as well as providing a wiki command should the bot itself not have the info you want.",

	"Website Project": "This Website lol",
	"Website Description": "The entire Website is written using Sass, React and Typescript!\n\nAll Components are entirely written by me, with only the bouncy arrows (like the one on the Skills Page) and Link Icon being from Material Icons, as well the Fonts 'Lato' (for texts like this one) and 'Exo 2' (for headers) from Google Fonts.\n\nI wanted to make this whole Website in Plain HTML/CSS/JS at first, but after I made the first page I decided that not using React when I have the ability to do so would just be a giant waste of my time lol",

	"Hitori Bot Description": "This is my personal Discord bot, completely written in Typescript with DiscordJS and a Webinterface with React and Tailwind!\nI add commands whenever I need them, so it's a bit of a mess, but it's my mess~\n\nCurrently the Bot can Archive Discord Servers and save them to a local SQLite File (with Media and all) and I've also made a Webinterface to view and search those Archives, making your Discord Server a bit more future proof~ (Please don't shut down any time soon tho, Discord)\n\nI'm planning on adding more commands in the future, but I'm not sure what I want to add yet, so if you have any ideas, feel free to contact me~",

	"Frostlight Widgets Description": "These are Desktop Widgets written with AGS, which uses JS to create GTK3 Widgets!\n\nI created these for personal use on my Linux system and am still using them to this day!\nIf you want more screenshots, just visit the GitHub Page!\nThey are not completely done yet, you can find the full Roadmap on the GitHub page as well, buuut there's a lot planned for them.\nMedia Controls, Theme Customization, an Application Launcher, a Notification Center, you name it!",

	"More Projects": "More to come!",
	"More Projects Text": "Currently that's all I want to share on this website, but I have other public Projects as well, they might just not be as polished as I'd like them to be or not finshed at all...\n\nIf you feel like checking those out as well, you can click the 'More to come' header (or the image) to get to my Github (or go there via the 'Contact' Page~)"
}
